---
kind: method
id: M:Autodesk.Revit.DB.Macros.AddInIdAttribute.#ctor(System.String)
source: html/374adf28-da33-b1b3-4873-64e68095570f.htm
---
# Autodesk.Revit.DB.Macros.AddInIdAttribute.#ctor Method

Constructs a new AddInIdAttribute.

## Syntax (C#)
```csharp
public AddInIdAttribute(
	string addInIdStr
)
```

## Parameters
- **addInIdStr** (`System.String`)